# Как ставить задачу
Написать программу сложения двух чисел
На языке C#
для MacOS и Windows
В которую пользователь вводит 2 числа/генерируются/подтягиваются из базы данных
С целыми чистами


# Типы переменных
double веществвенные числа
int целые числа
string от 0 до много символов
bool true / false

# математические операции
+
-
/
*
% остаток от деления
() меняют приоритет операций


# Команды

```sh
dotnet new console - создать новый проект
dotnet run - запустить проект
```
Через __Console__ мы обращаемся к системному терминалу

```sh
Write(); Вывод в одну строку
WhriteLine(); В конце перейти на новую строку
ReadLine(); Считать строку из терминала
```

new Random().Next(min,max)
даст случайное целое число от min до max-1
[min,max) или [min,max-1]

## Ветвление
if(username.ToLower() == "маша")
{
    Console.WriteLine("Ура, это же МАША!");
}
else
{
Console.Write("Привет, ");
Console.WriteLine(username);
}

ToLower() мешяет все буквы на нижний регистр